[
    {
        "actor_actress": "James Norton",
        "character": "Sidney Chambers",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/james-norton-as-sidney-chambers/",
        "about": [
            "About the Character:  Sidney is a young man who fought and killed in World War II, adores jazz, drinks too much, attracts female attention—and just happens to be the vicar of a Cambridgeshire village. His unlikely partnership with Inspector Keating is central to the series.",
            "Where You’ve Seen Him Before: MASTERPIECE fans may recognize Norton from playing lawyer Henry Alveston in the mystery Death Comes to Pemberley, or spied him in To Walk Invisible: The Brontë Sisters—where toy soldiers come to life and he’s the mini Duke of Wellington! Other period roles include Prince Andrei Bolkonsky in 2016’s War and Peace and tutor John Brooke in 2019’s Little Women. He first won critical acclaim playing a psychopath killer in Happy Valley.",
            "Fun Fact: While Norton was in drama school, he earned money leading children’s games and dispensing gummy bears at their parties. “I ran kids’ parties, cycling around London on Saturday mornings … taking 50 children for a birthday party with a rucksack full of Haribo,” he told Esquire.",
            "Related Content: Read our interview with Norton about his time on Grantchester—and have a chuckle watching he and Robson Green play The Grantchester Bromance Game!        "
        ]
    },
    {
        "actor_actress": "Robson Green",
        "character": "Geordie Keating",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/robson-green-as-geordie-keating/",
        "about": [
            "About the Character: Geordie is the lovably crabby detective with a gruff exterior and heart of gold. His methodical approach to policing complements the more intuitive techniques of his vicar friends. He’s a no-nonsense, plain-speaking man who holds mental scars from serving in World War II. Geordie is the husband of Cathy Keating and a devoted father of four.",
            "Where You’ve Seen Him Before: Aside from his work on Grantchester and Soldier Soldier, Green is also recognized for roles in Touching Evil and Reckless. He also appeared in the series Being Human alongside Poldark star Aidan Turner.",
            "Fun Fact: Green had a brief career in the music industry as one half of the mid-90s pop duo Robson and Jerome. More recently, he and Grantchester co-star Tom Brittney had cameos as backing guitarists for Sam Fender in the North Shields’ singer’s music video.",
            "Related Content: Read our exclusive cast interview with Green and check out his audio interview with the MASTERPIECE Studio podcast."
        ]
    },
    {
        "actor_actress": "Morven Christie",
        "character": "Amanda Kendall",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/morven-christie-as-amanda-kendall/",
        "about": [
            "About the Character: Amanda is the beautiful society girl and free spirt whose love for Sidney Chambers must remain as no more than friendship. The two have known each other for a long time—Amanda went to school with Sidney’s sister. It’s she who gave Sidney the Labrador pup named Dickens.",
            "Where You’ve Seen Her Before: Morven is known for her portrayal of architect Ellen Rooney in The Replacement. She’s been in TV series such as The Bay, The A Word, and Doctor Who, and films including The Young Victoria and Road Dance.",
            "Fun Facts: Christie left school at age 16 and was employed as a waitress, retail assistant, and a ski instructor who even helped get ski boots on her students’ feet before turning to acting. “I’ve always been a doing person,” she told The Scotsman.",
            "Related Content: Hear Christie talk about Grantchester’s star-crossed lovers on the MASTERPIECE Studio podcast."
        ]
    },
    {
        "actor_actress": "Tessa Peake-Jones",
        "character": "Mrs. Maguire",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/tessa-peake-jones-as-mrs-maguire/",
        "about": [
            "About the Character: “Mrs. M” is the vicarage’s housekeeper—an indomitable soul who keeps everyone in check and does her best to make a chaotic household presentable. She’s been a local all her life, speaks her mind and can be a bit of a busybody.",
            "Where You’ve Seen Her Before: She might be recognized from her role in Season 1 of Unforgotten, but Peake-Jones is best known for her work in the 1980 film Pride and Prejudice and the series Only Fools and Horses.",
            "Fun Fact: Before Grantchester, Peake-Jones worked with Robson Green on an episode of the British medical drama series Casualty—and with a very naked James Norton on the indie film Bonobo, about a bohemian commune.",
            "Related Content: Read our exclusive cast interview with Peake-Jones and listen to her speak with the MASTERPIECE Studio podcast."
        ]
    },
    {
        "actor_actress": "Al Weaver",
        "character": "Leonard Finch",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/al-weaver-as-leonard-finch/",
        "about": [
            "About the Character: Leonard is the well-groomed, buttoned-up curate who tries to mix philosophy with theology. He’s perpetually nervous and very sweet. A closeted gay man, Leonard has been an outsider his whole life. His escape is books. ",
            "Where You’ve Seen Him Before: On MASTERPIECE, Weaver played journalist James Edwards in Press and an antiquities museum employee in Sherlock’s “The Blind Banker” episode. He’s also known for his role in the film Colette alongside Poldark star Eleanor Tomlinson, Baptiste and Mrs. Wilson star Fiona Shaw, and Les Misérables star Dominic West.",
            "Fun Fact: Beyond stage and screen, Weaver also voiced characters in two video games: Rees Wakefield in The Complex, an interactive sci-fi thriller, and Rex in the open-world RPG Xenoblade Chronicles 2.",
            "Related Content: Check out Weaver’s exclusive cast interview and enjoy his conversation with MASTERPIECE Studio podcast."
        ]
    },
    {
        "actor_actress": "Tom Brittney",
        "character": "Will Davenport",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/tom-brittney-as-will-davenport/",
        "about": [
            "About the Character: Affable and optimistic, Reverend Davenport brings new energy to the church in Grantchester. He has a strong moral compass along with a thirst to change things—but struggles with who he really is and who he tries to be for everyone else. Will is like the son Geordie Keating never had.",
            "Where You’ve Seen Him Before: Audiences may recognize Brittney from his portrayal of Jack Rawle in Season 3 of Call the Midwife, or fan-favorite Lieutenant Jeremy Foster in the first two seasons of Outlander. He has also played the decidedly not good guy Roger Lockwood in the drama series UnReal. More recently, Tom starred alongside his idol Tom Hanks in the film Greyhound.",
            "Fun Facts: After acting, Brittney’s second passion is photography, specifically the documentary sort. “I have been to a few protests and I like to capture emotion—or trying to,” he told The Protagonist Magazine. “I like watching documentaries and if I wasn’t an actor and had the guts, I probably would have liked to be a war photographer.”",
            "Related Content: Get to know a bit more about Brittney and listen to him discuss joining the Grantchester cast on the MASTERPIECE Studio podcast."
        ]
    },
    {
        "actor_actress": "Kacey Ainsworth",
        "character": "Cathy Keating",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/kacey-ainsworth-as-cathy-keating/",
        "about": [
            "About the Character: Cathy is Geordie Keating’s charming and mostly supportive wife, and mother of their four children. Her husband’s demanding job and lack of involvement at home has caused tension between them at times. She finds a great deal of satisfaction in creating a role for herself beyond homemaker.",
            "Where You’ve Seen Her Before: Ainsworth played the long-suffering Little Mo in the British soap opera EastEnders and previously appeared in the police procedural, Holby Blue. She also took the role of kind Miss Gullet in the children’s program, The Worst Witch.",
            "Fun Fact: As a 10-year-old, Ainsworth began her professional career in the award-winning musical Annie, selected from a large open audition. She returned for two subsequent runs of Annie and was in a film alongside Peter Sellers before hitting pause at age 14 to focus on her education. (Glad she’s back!)",
            "Related Content: Hear Ainsworth describe her Grantchester character on the MASTERPIECE Studio podcast."
        ]
    },
    {
        "actor_actress": "Oliver Dimsdale",
        "character": "Daniel Marlowe",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/oliver-dimsdale-as-daniel-marlowe/",
        "about": [
            "About the Character: Marlowe is the quietly charming photographer in town. He slowly eases his way into a friendship with the closeted curate, Leonard Finch.",
            "Where You’ve Seen Him Before: Dimsdale played the Prince of Wales in the Season 4 Christmas episode of Downton Abbey and Mr. Keen in Mr. Selfridge—both on MASTERPIECE. More recently, he’s has had roles in series such as The Murders at White House Farm and The Last Czars.",
            "Fun Fact: Dimsdale has always stuttered. He surprised school mates by auditioning for a radio play. “I’d read the script; knew which bits I was doing. And because it was there in black and white, I didn’t stammer for the whole of the audition … and the next day I got the part,” Dimsdale told the MASTERPIECE Studio podcast. “Once I’ve learned a line and I know the rhythms of a scene … I no longer think of myself as someone who stammers. So I don’t.”",
            "Related Content: Check out Ollie Dimsdale’s full interview on the MATERPIECE Studio podcast."
        ]
    },
    {
        "actor_actress": "Nick Brimble",
        "character": "Jack Chapman",
        "link": "https://www.pbs.org/wgbh/masterpiece/cast-member/nick-brimble-as-jack-chapman/",
        "about": [
            "About the Character: Jack Chapman and Silvia Maguire (aka Mrs. M) grew up together in the village of Grantchester. He worked in India right after the war and became quite well-to-do later in life. Jack and Silvia are easy companions; he helps widen her horizons and gets her to try new things.",
            "Where You’ve Seen Him Before: Brimble has had a long, consistent acting career. His film work began when he played The Monster in 1990’s Frankenstein Unbound. He’s recognized for roles like Little John in Robin Hood, Prince of Thieves alongside Kevin Costner, and Sir Ector in A Knight’s Tale with Heath Ledger and Victoria’s own Rufus Sewell.",
            "Fun Fact: Brimble grew up in an acting family. In his teenage years, the Brimbles became involved with a Czech/French troupe of high-wire walkers called The White Devils. He spent several happy summers traveling through Europe with them!",
            "Sign up to get the latest news on your favorite dramas and mysteries, as well as exclusive content, video, sweepstakes and more."
        ]
    }
]